Data Cleaning and PreProcessing
Suppose you have  many data and that data are messy 
Pandas Gives you a power to clean and transform the data before analysis it

In [1]:
import pandas as pd
df=pd.read_csv('data_cleaning_example.csv')
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [ ]:
df.isnull().sum() # to check how many null values are there in each column

Name         1
Age          3
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

In [ ]:
df.dropna(axis=1) #drops columns with any null values
# df.dropna(axis=0) #drops rows with any null values
df.fillna(0) # fills all null values with 0
df['Age'].fillna(df['Age'].mean()) # fills null values in 'Age' column with mean of that column
df.fillna(method='ffill') # forward can be used with axis=0 or axis=1
df.fillna(method='bfill') # backward can be used with axis=0 or axis=1

C:\Users\adity\AppData\Local\Temp\ipykernel_416\770960240.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill') # forward
C:\Users\adity\AppData\Local\Temp\ipykernel_416\770960240.py:6: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill') # backward

      Name        Age         City Gender              Email   Join Date
0    Alice  25.000000     New York      F  alice@example.com  01-05-2021
1  Charlie  25.833333        Delhi      M    charlie@example  20-07-2021
2      Bob  30.000000  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  25.833333        Delhi      M    charlie@example  20-07-2021
4    David  22.000000       Mumbai      M  david@example.com  12-11-2019
5    Alice  28.000000        Delhi      F     eve@domain.com  01-05-2021
6    Alice  25.000000     New York      F  alice@example.com  01-05-2021
7    Alice  25.000000     New York      F  alice@example.com  01-05-2021
8  Charlie  25.833333        Delhi      M    charlie@example  20-07-2021

In [ ]:
# Removing the dupliacate values
df.duplicated() # to check how many duplicate rows are there
#Flase means unique row and True means duplicate row

0    False
1    False
2    False
4    False
5    False
dtype: bool

In [ ]:
# suppose u dont want duplicate rows
df.drop_duplicates() # this will remove duplicate rows and keep only unique rows
print("Duplicates Droped",df) # original dataframe remains unchanged

Duplicates  Droped       Name        Age         City Gender              Email   Join Date
0    Alice  25.000000     New York      F  alice@example.com  01-05-2021
1  Charlie  25.833333        Delhi      M    charlie@example  20-07-2021
2      Bob  30.000000  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.000000       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.000000        Delhi      F     eve@domain.com         NaN

In [ ]:
df.duplicated(subset=['Name','Age']) # to check duplicates based on specific columns

0    False
1    False
2    False
4    False
5    False
dtype: bool

In [ ]:
df['City'].str.contains('New')  # to filter rows where 'City' column contains the substring 'New'

0     True
1    False
2    False
4    False
5    False
Name: City, dtype: bool